[{"title": "Magic's Return: I Can See The Spirits", "author": "SleepDeprivedSloth", "rating": "4.0", "categories": ["Fantasy", "Action", "Romance", "Comedy"], "comments": ["This is a very fun novel, very very fun to read, at least for me\nDo note that it isn’t very grounded or complex, but it isn’t trashy, and it is a pleasant read\nAlso you might end up hating mc at some points", "Any novels with similar romance? Pls reccomend me some...", "How is romance", "The novel has good romance, pacing, fight scenes, but Vaan feels like a 15 year old.\nWhat 31 year old genocidal mob boss says things like “simp general” and has the patience and ego of a toddler? His *ss would’ve gotten killed years ago.\nIf you can get past the fact the mc is basically an egotistical teenager with no character development yet, the rest of the novel is enjoyable.", "I can’t get over his personality. He literally attacks people and when they defend themselves he says “my life is so precious how dare he try to take it from me”", "Well I would argue that isn’t actually as bad as some other actions he takes as most gangsters use self-justification as a way to cope with the crimes they commit. I personally can’t get over how he literally acts like a kid fresh out of elementary school.", "This novel genuinely tick's off all the boxes for a perfect Novel:\nOp MC... ✔️\nOp FMC... ✔️\nGood Chemistry b/w the MC and The FMC... ✔️\nMC actually Shows emotions and is relatable... ✔️\nGangster MC... ✔️\nOp Parents... ✔️\nGood Chemistry b/w The Parents... ✔️\nParents Love the MC... ✔️\nCharacter Development... ✔️\nFocus on Side Characters... ✔️\nA reasonable Power system... ✔️\nB*tch Slapping... ✔️\nNo Harem...✔️\nRedemption... ✔️\nPotential for Good Story/ World Development... ✔️\nAll round this novel could very well written and haves the potential to be one of the best ones out there...So far the potential is being realized and The Mc isnt Black Hole lvl Dense. He gets hints thrown his way...The Chemistry Absolutely Fantastic B/w the MC and the FMC...", "So should i start reading it?", "It's SleepDeprivedSloth, I trust them to put out quality once the novel hits its stride", "Relatable MC? The guy is an *ssh*l* for the sake of being an *ssh*l*\nThe novel is also full of cliches\nDont worry pal, when you read a good novel you will see that this is one is \"fun\", but not good", "Both of you do get that this is supposed to be a Medieval Romance Fantasy in that sense it does haves nearly all the elements to make it perfect... While it is Full Of cliches What the heck else type of Plot twist do u expect from it. The story is doing what its supposed to do... And as for \"that I havent read 'Good' novels\" I had a Library which exceeded 50+ Novels just on this site. I have read alot of Novels for the past 2 years... I have been through more novels than most ppl on this site. All of them have their Good points and Bad Points but hardly enough the story actually fulfills the type of setting its set in This ones actually does that.", "If this is a list for your perfect novel, I can honestly say you haven't read even one decent novel.\nIf anything this novel has every cliche possible from every novel from every genre.", "Your giving the benefit of the doubt here. Some people even after experiencing good stories still praise mediocre titles, I guess it depends on how 'lenient' you are with a story, cause personally I find 99% of 'good' stories as mediocre. I assume what you meant to say was people getting tired of cliches or tropes but again, some people just don't.", "After reading till chapter 169..\nI can see in the near future...\nVaan will convert all his family members into gangster...\n(Imagine)..\nVaan family members mage using fist, kicks, full-street style fighting while using magic...\nHe.h..heee... heeheh..\nImagine...he.hee.heheh...\n(GANGSTER PARADISE)\nbeing played when Vaan family mage are fighting or are in the war ...", "My magic familia", "Finally gangster like personally with op magic", "concept and world is cool but the one biggest thing that gets at me is that the character and what happens is really just a self insert like you cant just take a dude whos supposed to be a hardcore gangster who did all types of underworld stuff in 7 years get reincarnated then start calling people simp generals and calling himself the main character like be fr this is just the author venting himself in an outlet lol if you can get past that its fine", "What gave away that the author was venting is how the MC gets almost a paragraph to roast people, but they only get a few sentences to retort back. And this happens multiple times.", "You enjoying the league man?", "Yea it kinda feels like the whole gangster thing dropped without any major reason in the story but rest of it is pretty good", "Good, as that was going nowhere", "Dropping/shielfing it for now,read the first 9 chapters and can't seem to get with MCs personality and brashness,prob just a preference thing ion know🚶‍♂️", "It's nice, although the focus on magic seems to waiver. Near the 100's chapter, it delves into world-building but appears to forget also to build the magic system along with the mc's progression in the craft.", "Author in supreme harem system: 😈👹\nAuthor in magic's return (I have no enemy)🌱🦋", "author in Primordial Vampire god System: Genocidal maniac emoji here"]}, {"title": "Taking the Mafia to the Magic World", "author": "RVN_1998", "rating": "4.1", "categories": ["Fantasy", "Action", "Adventure", "Tragedy", "Harem"], "comments": ["I thought hes taking all his mafia member into another world, i was hoping a novel like Overlord where MC and the entire NPC goes isekaied. Are there a novel similar to Overlord?", "I give my turtle seal of approval. I look forward for more chapter. It interesting how the mc navigates his way thru trials towards his goal while getting into otger situation.", "Thank you for your thoughts o wise turtle", "Thanks for your thoughts o wise turtle.", "So I'ma comment what I've read for the past 200 chapters or so.. one thing I observe is that Author always driving mc to the most unfortunate things, he really must hate his mc.\nHe created problems for mc left and right and makes it proliferate. Leading one problems to another without changing pace(ngl kinda mentally exhausting) The pace is so slow with repetitive plots that it's kinda suffocating and hard to bear. So yeah I dropped it around 200 chapter cuz of the repetitive plots", "W8 till the author reincarnated into the MC", "Hah, knew it after I read that “he will suffer heavy losses.” in the summary. What tf is that?", "Trust me bro, this novel is good. 😌", "I'll take your word on that, good sir.", "So how it is so far!?!\nI'm thinking about giving it a try 😅", "slow pace is all I can say. like most others comment. but it is a good read. I don't want to spoil anything. but for me, the story starts getting good around chp17-ish. before that, you can treat it as soft infodump/knowing several characters more before you can kinda feel the story start to move more progressively.", "Just so all you fellow readers know. This novel is very slow paced and author takes his time with it and the chapters are also considerably small so if you are thinking to pick this up then keep it in mind. It's a good story no doubt but really slow", "So wait 2 years before hoping on, got it.", "I couldn't have said it better myself", "Just commenting because I just went through this tragedy part of this novel and no sh*t ..this ain't for weak hearted it's like a sudden hit of high speeding bus...sh*t just goes down hill and it's pretty sad and makes us anxious...thers no rape or stuff but definitely sudden tragedy..\nSo if you don't like stories going sudden downhill out of no where when everything is positive..just skip this\nThe story till now is not bad but beware of that tragedy tag...author is not kidding when he kept this tragedy tag here... he did a mess there", "Man...\nMC be like...\n(My name is Tommy ... Vinecent Shelby)\nEvery time I read..I always\nhear peaky blinders theme song ...", "I stopped reading when one chapter there was no gun then next chapter he's had guns for months several of them too he just happened to never mention it. Lazy writing I already don't like where it's going", "Read the next chapter and you'll know why", "I understand thr author says he made them months ago that's not the point. The point is that the author just makes mc has gun out of no where's and then write it that he had them for months it's lazy it's like author forgot gun existed and made no preparation for mc to have guns just wrote them into existence in a instant. Author can remember to describe mc's mother and sister breast but forget to add a plot of making or even mentioning guns.", "He tried to make guns before by hiring his local blacksmith to work on the part. He was a Mafia member so he knew how to assemble a gun. He didn't reveal that he had them because he tested them against beasts, and it wasn't very effective, so he scrapped that idea. Jesse is just a slightly stronger human so killing him with a gun is fine.", "Read Release the Witch and you'll realize how d*mn hard it is to create a gun in a fantasy world", "I don't know much about guns, but that is the author's explanation for the existence of guns in the novel\nBut I'll make sure to check on that novel, Thanks!", "You're not understanding that the author didn't lead up to him making gun he just wrote In after introducing the gun out of nowhere. It's like if the novel went on for 1000 more chapters and during a fight the mc tosses a marble ( that never been seen or talked about previously) on the ground that kills the main villan then write in the next chapter \" I've had this marble in my pocket since I was 2 years old lucky it came in handy 23 years later\"", "I admit that introducing guns out of no where is kind of skipping the build up that we all wanted, and yes it is also kind of lazy to justify guns existence with one chapter", "about a third of the way through (120 chapters or so) and this is really good so far. the mc is interesting, the plot is sound (as far as i know, dont quote me on it), and the premise is interesting\nIm excited for the next 2 thirds of it", "There were too many comments that talked about the tragedy but didn't explain what exactly was going to happen, it put a lot of people off, including me. Can someone write a spoiler about the tragedy? It's very important to me and maybe others who might want to read it.", "The MC was Isekaied and born into a loving family, but about 20 chapters in, when his family was traveling to a city for his father's business, his pregnant mother was killed because of a stray magical attack. After the event, his father went into drinking, one of his sisters went deaf while another is blind. Later his blind sister is kidnapped by some unsavory people, his father after hearing the news die of a heart attack, leaving the MC and his deaf sister to fend for themselves.\n- That about it", "Who kidnapped her ..just want to know please spoil this part? And the progress about her", "A faction called Nixlas' Shadows kidnap her, and 300+ chapters in, 0 progress except for some reminders every few chapters of her kidnap.", "Why did they do it..she's already blind...is there a particular reason for kidnapping her?", "She has a scythe shape magic gem (signified special power) and it is green (signified high potential to be powerful)", "Thank you very much, I think this will help many people decide whether to read it or not."]}, {"title": "I'll Surpass The MC", "author": "Anvelope", "rating": "4.3", "categories": ["Eastern Fantasy", "Fantasy", "Action", "Adventure"], "comments": ["Any romance?", "Romance is like size of an ant head", "If there was gonna be someday virala hate club, i think we have the most suitable candidate for the president of that club, its that one guy that always comment f*ck virala in every chapter hahaha", "Who's that 🤔", "I'm at chapter 198 and the arc is boring me to death. Can any readers at future chapters tell me some spoilers so that I can continue?", "The first part of Volume 2 (chapters 97-182) sort of acts as a setup for later events in the book as a whole. The action in Volume 2 really picks up from chapter 188 to the end of volume 2 (chapter 235). While not as exhilarating (overall) as Volume 1, Volume 2 is still good and provides lots of information as this is required for Volumes 3 and 4 to reach the same level of excitement, engagement and world building as Volume 1. You would immediately observe that Volume 3 continues in the same vein/mould as Volume 1 (i.e. observing the perspectives of the other “main” characters, progression of multiple aspects of the plot, plotting, scheming and the development of other characters’ powers).\nGiven where you are in the story, I think you will soon reach points of great excitement again.", "But where's the genderbender tag?", "Author forget to put it", "?...", "minor spoiler", "I am writing this comment on behalf of the author. His message below is about his Discord server where readers can also interact with one-another and discuss the novel. Please note that no early novel chapters will be posted on this Discord server.\nHello everyone, this is a message from the author: I want to invite everyone to my discord server: discord.gg/BR5kt99dhV\nThere are currently ~250 members already. If its numbers reaches 300 by the end of this month, I'll release a special bonus chapter (10k words long) of the 1st Minor Crisis from Sumatra Chronicles (It's a bribe to get you to join). Do spread the invite link to other readers of this novel. See you on discord~", "Do you guys think Inala can get a period if he stays in his queen form too long or nah?", "Do animals also have periods, I thought only humans got the exclusive right for that shít", "they do just like (at least im pretty sure) most other mammals.", "I'm not putting that on my search history 👨‍🦯", "I did, and most of them don't have periods", "OK so 11 chapters in and it's actually good. Decent at worst. I have no idea why people have been saying it's bad, though it might be because I'm still in the early chapters. We'll edit if I change my mind but so far so good 👍", "It's actually pretty dàmn good and the reason for people saying it's bad is that the 1st arc was so good that the 2nd arc seems lackluster in comparison", "I'm currently at chapter 240. You are right, its really good👍 hope for more novels from the author", "is it just me or does the guy on the cover resemble an athletic version of Senku from Dr. Stone", "athletic version Senku would be Ken from Sunken Rock", "honestly sounds like a tongue twister", "Is this novel a hidden gem? I mean plotwise and character development etc...\nI want to read other novels since I'm currently stacking new chapters of SS.", "Yes", "Who tape the mc? I am at 25 chapter and had thought that granny oyo might become fl but it seems to be there is something else in ahead chapters. Spoilers are fine.\nAnd pls also tell if there is love interest or not.", "Trust me my friend... It is way better reading than hearing it from spoilers... Anyway somebody spoiled it ...", "Granny oyo r*p*d inala and went away, although she dies later on birthing his child. And don't worry there is no b*llsh*t like keeping and caring for the child cause the child is by herself a being with more than 5 millennias of knowledge.\nSo yeah she is just better than mc even if she is a child.", "U got me intrigued how th duck is that possible if u can spoil idc i really need to know how thats possible", "Emperian tusk c*p*l*t* by making the mammoth clansmen who have fagment disease give birth of a child whose both parents are fagment disease holders.\nNow when the child is about to be born they ' the empyrean tusks' choose who is gonna give their memories to the new born. Memories include basic things like how the mammotj clansmen are significant and other life related things and other important things like prana usage or any lesson regarding those exclusive topics that include skills and etc.\nNow you may wonder how does that work? Well when you have a life as long as 2000 years along with a whole settlement living on your back whose thoughts you can access anytime u gotta nitpick a hell lotta skills.\nNow gannala is someone who has million years worth of knowledg, just pure knowledge, enough to create 7 ways to mystic realm when the whole bloody tusk clan can't find one. That much.\nAnd don't underestimate knowledge collection like this cause you are effectively making a hive mind.", "The child of the 2 Is and empyrean tusk and the successor of th supreme tusk so she has all her memory's but most of them are locked. Also it's not 5 thousand years of knowledge it's way more. Because an empyrean tusks lifespan is 2 thousand years and because gannala inherited the memory's of 188 empyrean tusks she probably has something like 378 000 years worth of memories even though less than 0.0001% of them are available", "Thanks dude really appreciate it coz it was driving me crazy i needed to know"]}]